# Pandas

In [1]:
#"Python Data Analysis Library"

In [ ]:
there are 2 types of data sturcture 
they are 
1) series
2) DataFrame

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [7]:
#Series 
x=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(x)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [21]:
#Series 
x=pd.Series([1,2,3,4,5],index=range(0,5))
print(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
.loc()
.iloc()

np.int64(2)

In [4]:
s = pd.Series([10, 20, 30], index=['Math', 'Sci', 'Eng'])
print(s)

Math    10
Sci     20
Eng     30
dtype: int64

In [7]:
x=pd.Series([95,88,92],index=['Math','Science','English'])
print(x)

Math       95
Science    88
English    92
dtype: int64

In [9]:
print(x['Science'])

88

In [13]:
x['English']=94
print(x)

Math       95
Science    88
English    94
dtype: int64

In [18]:
x['Computer']=90
print(x)

Math        95
Science     88
English     94
Computer    90
dtype: int64

In [25]:
data={
    'Name':['Puja','Riya','Amit'],
    'Age':[21,22,23],
    'Marks':[92,89,85]}

x=pd.DataFrame(data)
print(x)

   Name  Age  Marks
0  Puja   21     92
1  Riya   22     89
2  Amit   23     85

In [28]:
print(x['Age'])

0    21
1    22
2    23
Name: Age, dtype: int64

In [32]:
print(x.loc[0])

Name     Puja
Age        21
Marks      92
Name: 0, dtype: object

In [35]:
print(x.loc[:,'Marks'])

0    92
1    89
2    85
Name: Marks, dtype: int64

In [38]:
print(x.loc[1,['Name','Age']])

Name    Riya
Age       22
Name: 1, dtype: object

In [44]:
print(x.loc[x[ 'Name']== 'Puja'])

   Name  Age  Marks
0  Puja   21     92

In [45]:
print(x.loc[0])

Name     Puja
Age        21
Marks      92
Name: 0, dtype: object

In [51]:
print(x.loc[1 ,'Age'])

22

In [56]:
print(x.loc[2,['Name','Marks']])

Name     Amit
Marks      85
Name: 2, dtype: object

In [64]:
print(x.loc[:,'Marks'])

0    92
1    89
2    85
Name: Marks, dtype: int64

In [72]:
print(x.loc[ x[ 'Name']=='Puja'])

   Name  Age  Marks
0  Puja   21     92

In [3]:
# series 
x=pd.Series([5,6,7,8,9],index=['a','b','c','d','e'])
print(x)

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [5]:
print(x['a'])

5

In [7]:
print(x['a':'d'])

a    5
b    6
c    7
d    8
dtype: int64

In [8]:
# series 
x=pd.Series([5,6,7,8,9])
print(x)

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [10]:
x.loc[1]

np.int64(6)

In [11]:
# series 
x=pd.Series([5,6,7,8,9],index=['a','b','c','d','e'])
print(x)

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [12]:
x.loc['b']

np.int64(6)

In [ ]:
.loc=> explicit lock
to get access through only index

In [ ]:
.iloc => implicit lock
yo le 2 ota lock rakh xh
auta chai user le deko and next chai by default 0,1,....

In [ ]:
# DataFrame
to handle tabular data
#dictionary

In [15]:
dis={
    'roll':[4,5,9],
    'name':['puja', 'kabi','manju'],
    'faculty':['DS','BE','civil']
}
# key ma multiple  value rakh ko lagi list use hunch
df=pd.DataFrame(dis)
print(df)

   roll   name faculty
0     4   puja      DS
1     5   kabi      BE
2     9  manju   civil

In [16]:
type(df) =>for checking type

pandas.core.frame.DataFrame

#dataFrame
Atributes
-.shape
-.columns

In [17]:
df.shape => to find no of rows and columns

(3, 3)

In [18]:
df.columns

Index(['roll', 'name', 'faculty'], dtype='object')

In [ ]:
#DataFrame
Functions
=>head()
=>tail()
=>sample()
=>shapes =>no of rows and cols
shapes[0]=>no of rows
shapes[1]=> no of cols

In [20]:
data=pd.read_csv('Salary_Data.csv') # for reading csv file use read_csv with location and name if it lies in different floder else only name

In [21]:
print(data)

       Age  Gender    Education Level              Job Title  \
0     32.0    Male         Bachelor's      Software Engineer
1     28.0  Female           Master's           Data Analyst
2     45.0    Male                PhD         Senior Manager
3     36.0  Female         Bachelor's        Sales Associate
4     52.0    Male           Master's               Director
...    ...     ...                ...                    ...
6699  49.0  Female                PhD  Director of Marketing
6700  32.0    Male        High School        Sales Associate
6701  30.0  Female  Bachelor's Degree      Financial Manager
6702  46.0    Male    Master's Degree      Marketing Manager
6703  26.0  Female        High School        Sales Executive

      Years of Experience    Salary
0                     5.0   90000.0
1                     3.0   65000.0
2                    15.0  150000.0
3                     7.0   60000.0
4                    20.0  200000.0
...                   ...       ...
6699                 20.0  200000.0
6700                  3.0   50000.0
6701                  4.0   55000.0
6702                 14.0  140000.0
6703                  1.0   35000.0

[6704 rows x 6 columns]

In [22]:
#DataFrame -attributes,functions
attributues

In [24]:
data.head() # =>it gives top 5 rows
#by default top 5

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [25]:
data.head(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0

In [26]:
data.tail() # by default it last 5 rows

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [27]:
data.tail(10) # it last 10 data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6696,28.0,Male,PhD,Sales Representative,4.0,55000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [28]:
data.sample() # it gives randomly data from table
# by default it gives only one data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
5070,21.0,Female,High School,Junior Sales Representative,0.0,25000.0

In [29]:
data.sample(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
480,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
1601,42.0,Male,PhD,Senior Software Engineer,14.0,170000.0
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6069,25.0,Male,Bachelor's Degree,Product Manager,1.0,60000.0
4314,34.0,Male,Bachelor's Degree,Operations Manager,8.0,101000.0
5994,29.0,Male,Bachelor's Degree,Marketing Analyst,4.0,70000.0
1222,42.0,Male,PhD,Full Stack Engineer,14.0,180000.0
865,28.0,Female,Bachelor's,Software Engineer,5.0,160000.0
6118,40.0,Female,Bachelor's Degree,Financial Manager,16.0,215000.0
5680,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0

In [31]:
#Exploratory Data Analysis(EDA) FOR EXPLORE DATA IN TABLE

In [32]:
data.shape #=> no of rows and no of columns

(6704, 6)

In [33]:
data.shape[0] #=> .shape[0] => it givess no of rows only

6704

In [34]:
data.shape[1] #=> .shape[0] => it givess no of columns only

6

In [36]:
print(data.columns)

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [37]:
#select particular rows or columns

In [39]:
#columns 
# Syntax : dataframe.column_name
data.Age

0       32.0
1       28.0
2       45.0
3       36.0
4       52.0
        ...
6699    49.0
6700    32.0
6701    30.0
6702    46.0
6703    26.0
Name: Age, Length: 6704, dtype: float64

In [40]:
data.Gender

0         Male
1       Female
2         Male
3       Female
4         Male
         ...
6699    Female
6700      Male
6701    Female
6702      Male
6703    Female
Name: Gender, Length: 6704, dtype: object

In [41]:
# another option to access columns 
# syntax dataframe['columns_name']

In [42]:
data['Gender']

0         Male
1       Female
2         Male
3       Female
4         Male
         ...
6699    Female
6700      Male
6701    Female
6702      Male
6703    Female
Name: Gender, Length: 6704, dtype: object

In [43]:
data.Educations level

SyntaxError: invalid syntax (417781411.py, line 1)

In [45]:
# to remove above error we use another way to access columns
data['Education Level']

0              Bachelor's
1                Master's
2                     PhD
3              Bachelor's
4                Master's
              ...
6699                  PhD
6700          High School
6701    Bachelor's Degree
6702      Master's Degree
6703          High School
Name: Education Level, Length: 6704, dtype: object

In [46]:
#rows

In [48]:
data.iloc[0]

Age                                 32.0
Gender                              Male
Education Level               Bachelor's
Job Title              Software Engineer
Years of Experience                  5.0
Salary                           90000.0
Name: 0, dtype: object

In [49]:
data.loc[0:5] # dataframe.loc[start : stop] 
# both are inclusive

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0

In [50]:
data.iloc[0:5] # dataframe.loc[start : stop] 
# start only inclusive but not stop

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [51]:
#to acess multiple columns use list for multiple columns
more than coulmn lai acces garnu xh vney we must acces by using dataframe
data[['Age','Gender']]

       Age  Gender
0     32.0    Male
1     28.0  Female
2     45.0    Male
3     36.0  Female
4     52.0    Male
...    ...     ...
6699  49.0  Female
6700  32.0    Male
6701  30.0  Female
6702  46.0    Male
6703  26.0  Female

[6704 rows x 2 columns]

In [52]:
data[['Age']]

       Age
0     32.0
1     28.0
2     45.0
3     36.0
4     52.0
...    ...
6699  49.0
6700  32.0
6701  30.0
6702  46.0
6703  26.0

[6704 rows x 1 columns]

In [53]:
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [ ]:
Numerical(int ,float)
Categorical(object)

In [54]:
data.info() # to check data type of all

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [55]:
data.describe()  to overview/summarize  the relation of data or data kastw xh

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [ ]:
1.import the neccessary libraries and import the dataset(tit